RIET/src/Catalogs/ProjectMobilizationManualItems/ProjectMobilizationManualItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProjectMobilizationManualItems</name>
  <owners>Catalog.ProjectMobilization</owners>
  <attributes>
    <name>ItemDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HazardClass</name>
    <type>
      <types>CatalogRef.HazardClasses</types>
    </type>
  </attributes>
  <attributes>
    <name>Qty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ItemValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RDD</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>POLine</name>
    <type>
      <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>PickUpWarehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>DeliverTo</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>DomesticInternational</name>
    <type>
      <types>EnumRef.DomesticInternational</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>CatalogRef.Catalog</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierAvailability</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReadyToShip</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>TotalGrossWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POD</name>
    <type>
      <types>CatalogRef.CountriesHUBs</types>
    </type>
  </attributes>
  <attributes>
    <name>Supplier</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RequestsCompleted</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BalanceQty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BalanceTotalGrossWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>Qty</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TotalGrossWeightKG</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Enums/DomesticInternational/DomesticInternational.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DomesticInternational</name>
  <enumValues>
    <name>Domestic</name>
  </enumValues>
  <enumValues>
    <name>International</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/СтрокиИнвойса/СтрокиИнвойса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтрокиИнвойса</name>
  <attributes>
    <name>Инвойс</name>
    <type>
      <types>DocumentRef.Инвойс</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportRequest</name>
    <type>
      <types>DocumentRef.ExportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиИнвойса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаЗаявкиНаЗакупку</name>
    <type>
      <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоИнвойсу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RAN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>CatalogRef.Catalog</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Классификатор</name>
    <type>
      <types>EnumRef.ТипыЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Активити</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>String</types>
      <types>CatalogRef.CountriesHUBs</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Manufacturer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйКодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящейДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NetWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WeightUOM</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>PSA</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>PermitsRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>Final</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LocalOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shortage</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EUCNotRequired</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EUCRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EUCReceived</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TNVED</name>
    <type>
      <types>CatalogRef.TNVEDCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>COORequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>ERPTreatmentNonLawson</name>
    <type>
      <types>CatalogRef.ERPTreatments</types>
    </type>
  </attributes>
  <attributes>
    <name>ProjectMobilization</name>
    <type>
      <types>CatalogRef.ProjectMobilization</types>
    </type>
  </attributes>
  <attributes>
    <name>HazardClass</name>
    <type>
      <types>CatalogRef.HazardClasses</types>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteeLetter</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>MOC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ClientPO</name>
    <type>
      <types>CatalogRef.ClientPO</types>
    </type>
  </attributes>
  <attributes>
    <name>ConfirmationOfCargoLatestDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBSReceiptDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BPN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPLetterRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/ProjectMobilizationManualItems/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьЭлементов()
	
	Если Не ЗначениеЗаполнено(Объект.DomesticInternational) Тогда 
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаInternational.Видимость = (Объект.DomesticInternational = ПредопределенноеЗначение("Перечисление.DomesticInternational.International"));
	Элементы.ГруппаDomestic.Видимость = (Объект.DomesticInternational = ПредопределенноеЗначение("Перечисление.DomesticInternational.Domestic"));
	Элементы.ГруппаIntPOItem.Видимость = (Объект.DomesticInternational = ПредопределенноеЗначение("Перечисление.DomesticInternational.International"));
	Элементы.Balance.Видимость = (Объект.DomesticInternational = ПредопределенноеЗначение("Перечисление.DomesticInternational.Domestic"));
    Элементы.ГруппаItemsCompleted.Видимость = (Объект.DomesticInternational = ПредопределенноеЗначение("Перечисление.DomesticInternational.Domestic"));
    	        
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РГСофт.ЗаполнитьModification(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура FillFromCatalog(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Каталог) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Catalog' is empty!",
			, "Каталог", "Объект");
		Возврат;
	КонецЕсли;

	СтруктураРеквизитовКаталога = ПолучитьСтруктуруРеквизитовКаталога(Объект.Каталог);
	
	Если ЗначениеЗаполнено(Объект.Наименование) 
		ИЛИ ЗначениеЗаполнено(Объект.ItemDescription)
		ИЛИ ЗначениеЗаполнено(Объект.DescriptionRus)
		ИЛИ ЗначениеЗаполнено(Объект.GrossWeightKG) Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполнениеПоКаталогу", ЭтаФорма, СтруктураРеквизитовКаталога);
		ПоказатьВопрос(Оповещение, "Перезаполнить поля по каталогу?", РежимДиалогаВопрос.ДаНет,,, "Заполнение по каталогу");
	иначе
		ЗаполненитьПоКаталогу(СтруктураРеквизитовКаталога);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаполнениеПоКаталогу(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполненитьПоКаталогу(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполненитьПоКаталогу(СтруктураРеквизитовКаталога) Экспорт
	
	Объект.Наименование = СтруктураРеквизитовКаталога.PartNo;
	Объект.DescriptionRus = СтруктураРеквизитовКаталога.DescriptionRus;
	Объект.ItemDescription = СтруктураРеквизитовКаталога.DescriptionEng;
	Если ЗначениеЗаполнено(СтруктураРеквизитовКаталога.NetWeight) Тогда 
		Объект.GrossWeightKG = СтруктураРеквизитовКаталога.NetWeight;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруРеквизитовКаталога(Catalog)
	
	Возврат Справочники.СтрокиИнвойса.ПолучитьСтруктуруРеквизитовКаталога(Catalog);
	
КонецФункции  

&НаКлиенте
Процедура ItemНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоВыбораItem(Элемент);
	                                   	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораItem(Элемент)
	 		
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Part number"" is empty!",
			, "Наименование", "Объект", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.DomesticInternational) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Dom/Int"" is empty!",
			, "DomesticInternational", "Объект", Отказ);
	КонецЕсли;
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	#Если ВебКлиент Тогда
	АктивноеОкно = АктивноеОкно();
	Если АктивноеОкно <> Неопределено Тогда
		Если АктивноеОкно.Содержимое.Количество() > 0 Тогда
			Если АктивноеОкно.Содержимое[0].ИмяФормы = "Справочник.СтрокиИнвойса.Форма.ФормаВыбора" Тогда
				АктивноеОкно.Активизировать();
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Имя", "ВыборИзManualItem");
	
	СтруктураНастройки.Вставить("КодПоИнвойсу", Объект.Наименование);
	СтруктураНастройки.Вставить("POLine", Объект.POLine);
	СтруктураНастройки.Вставить("DomesticInternational", Объект.DomesticInternational);   
	
	Если Объект.DomesticInternational = ПредопределенноеЗначение("Перечисление.DomesticInternational.Domestic") Тогда
		
		Если ЗначениеЗаполнено(Объект.Владелец) Тогда
			СтруктураНастройки.Вставить("ProjectMobilization", Объект.Владелец);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.PickUpWarehouse) Тогда
			СтруктураНастройки.Вставить("PickUpWarehouse", Объект.PickUpWarehouse);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.DeliverTo) Тогда
			СтруктураНастройки.Вставить("DeliverTo", Объект.DeliverTo);
		КонецЕсли;
		
		СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
		
	КонецЕсли;
	
	СтруктураПараметров.Вставить("СтруктураНастройки", СтруктураНастройки);
		
	ОткрытьФорму("Справочник.СтрокиИнвойса.ФормаВыбора", СтруктураПараметров, Элемент);
	                	
КонецПроцедуры

&НаКлиенте
Процедура POLineНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
		Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		#Если ВебКлиент Тогда
			АктивноеОкно = АктивноеОкно();
			Если АктивноеОкно <> Неопределено Тогда
				Если АктивноеОкно.Содержимое.Количество() > 0 Тогда
					Если АктивноеОкно.Содержимое[0].ИмяФормы = "Справочник.СтрокиЗаявкиНаЗакупку.Форма.ФормаВыбора" Тогда
						АктивноеОкно.Активизировать();
						Возврат;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		#КонецЕсли
		
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("Имя", "ВыборИзManualItem");
		
		СтруктураНастройки.Вставить("PartNo", Объект.Наименование);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СтруктураНастройки", СтруктураНастройки);
		
		ОткрытьФорму("Справочник.СтрокиЗаявкиНаЗакупку.ФормаВыбора", СтруктураПараметров, Элемент);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура DomesticInternationalПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементов();
	
	Объект.PickUpWarehouse = Неопределено;
	Объект.DeliverTo = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура POLineПриИзменении(Элемент)
	
	POLineПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура POLineПриИзмененииНаСервере()
	
	Объект.Наименование = Объект.POLine.КодПоставщика;
	Объект.ItemDescription = Объект.POLine.ОписаниеНоменклатуры;
	Объект.DescriptionRus = Объект.POLine.ОписаниеНоменклатуры;
	Объект.Каталог = Объект.POLine.Каталог;
	Объект.RDD = Объект.POLine.SupplierPromisedDate;
	Объект.Qty = Объект.POLine.Количество;
	Цена = Объект.POLine.Цена;
	Валюта = Объект.POLine.Валюта;
	Если Валюта <> Справочники.Валюты.НайтиПоНаименованию("USD") Тогда
		Цена = LocalDistributionForNonLawsonСервер.ПолучитьCostsSumSLBUSD(Цена, Валюта, Объект.POLine.Владелец.ДатаЗаявкиНаЗакупку);
	КонецЕсли;
	Объект.ItemValue = Цена;
	Объект.Supplier = Объект.POLine.Владелец.Поставщик;
    Объект.SupplierAvailability = Объект.POLine.SupplierPromisedDate;
	
КонецПроцедуры

// VALUES

&НаКлиенте
Процедура QtyПриИзменении(Элемент)
	
	Объект.TotalGrossWeightKG = Объект.GrossWeightKG * Объект.Qty; 
	Объект.TotalValue = Объект.ItemValue * Объект.Qty; 
	Объект.BalanceQty = Объект.Qty - Объект.Items.Итог("Qty");
	
КонецПроцедуры

&НаКлиенте
Процедура GrossWeightKGПриИзменении(Элемент)
	
	Объект.TotalGrossWeightKG = Объект.GrossWeightKG * Объект.Qty; 
	Объект.BalanceTotalGrossWeightKG = Объект.TotalGrossWeightKG - Объект.Items.Итог("TotalGrossWeightKG");
	
КонецПроцедуры

&НаКлиенте
Процедура ValueПриИзменении(Элемент)
	
	Объект.TotalValue = Объект.ItemValue * Объект.Qty;
	
КонецПроцедуры  

&НаКлиенте
Процедура TotalGrossWeightKGПриИзменении(Элемент)
	
	Объект.GrossWeightKG = ?(Объект.Qty = 0, 0, Объект.TotalGrossWeightKG / Объект.Qty); 
	Объект.BalanceTotalGrossWeightKG = Объект.TotalGrossWeightKG - Объект.Items.Итог("TotalGrossWeightKG");
	
КонецПроцедуры

&НаКлиенте
Процедура TotalValueПриИзменении(Элемент)
	
	Объект.ItemValue = ?(Объект.Qty = 0, 0, Объект.TotalValue / Объект.Qty); 
	
КонецПроцедуры

&НаКлиенте
Процедура ItemsПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	НачалоВыбораItem(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура RefreshValues(Команда)
	
	ОбновитьЗначенияItem();
	
КонецПроцедуры

&НаКлиенте
Процедура ItemsОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для Каждого ЭлементМассива из ВыбранноеЗначение Цикл 
		
		СтрокаItems = Объект.Items.Добавить();
		СтрокаItems.Item = ЭлементМассива;
		
	КонецЦикла;
	
	ОбновитьЗначенияItem();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияItem()
	
	СтруктураОтбораItem = Новый Структура("Item");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивItems", объект.Items.Выгрузить().ВыгрузитьКолонку("Item"));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ParcelsДетали.Qty) КАК Qty,
	               |	СУММА(ParcelsДетали.GrossWeightKG) КАК TotalGrossWeightKG,
	               |	ParcelsДетали.СтрокаИнвойса КАК Item
	               |ИЗ
	               |	Справочник.Parcels.Детали КАК ParcelsДетали
	               |ГДЕ
	               |	ParcelsДетали.СтрокаИнвойса В(&МассивItems)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ParcelsДетали.СтрокаИнвойса";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураОтбораItem.Item = Выборка.Item;
		МассивСтрок = Объект.Items.НайтиСтроки(СтруктураОтбораItem);
		
		Для Каждого СтрокаМассива из МассивСтрок Цикл
			
			Если СтрокаМассива.Qty <> Выборка.Qty Тогда
				СтрокаМассива.Qty = Выборка.Qty;
				ЭтаФорма.Модифицированность = Истина;
			КонецЕсли;
			
			Если СтрокаМассива.TotalGrossWeightKG <> Выборка.TotalGrossWeightKG Тогда
				СтрокаМассива.TotalGrossWeightKG = Выборка.TotalGrossWeightKG;
				ЭтаФорма.Модифицированность = Истина;
			КонецЕсли;

		КонецЦикла;
		
	КонецЦикла;  	
	
	BalanceQty = Объект.Qty - Объект.Items.Итог("Qty");
	Если Объект.BalanceQty <> BalanceQty Тогда
		Объект.BalanceQty = BalanceQty;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
	BalanceTotalGrossWeightKG = Объект.TotalGrossWeightKG - Объект.Items.Итог("TotalGrossWeightKG");
	Если Объект.BalanceTotalGrossWeightKG <> BalanceTotalGrossWeightKG Тогда
		Объект.BalanceTotalGrossWeightKG = BalanceTotalGrossWeightKG;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры
